Repository: Auston/local-repo
Catalog: share/translations/*.po
Languages: it

source: This program helps to manage local repositories. Specify the path to the repository with the first argument. If no option is specified, some repo information will be printed.
it: Questo programma aiuta a gestire i repository locali. Specifica il path del repository con il primo argomento. Se non viene specificata nessuna opzione, verranno stampate alcune informazioni.

source: %(prog)s path [options]
it: %(prog)s path [opzioni]

source: Please report bugs at: <{0}>
it: Si prega di segnalare i bug a: <{0}>

source: path to the repo
it: path del repo

source: add a package to the repo. path can point to a package file, a pkgbuild tarball or can be the uri of a downloadable pkgbuild tarball, e.g. in the AUR
it: aggiunge un pacchetto al repo. Il path può puntare al pacchetto, al tarball di un pkgbuild o può essere l'uri del tarball di un pkgbuild scaricabile, ad esempio, da AUR

source: name
it: nome

source: download, build and add a package from the AUR to the repo
it: scarica, compila e aggiunge il pacchetto da AUR al repo

source: run an integrity check
it: avvia una verifica dell'integrità

source: the elephant never forgets
it: l'elefante non dimentica mai

source: display info for specified packages
it: visualizza le info dei pacchetti specificati

source: list all packages from the repo
it: elenca tutti i pacchetti dal repo

source: remove packages from the repo
it: rimuove i pacchetti dal repo

source: Restore repo database
it: Ripristina il database del repo

source: term
it: termine

source: find packages
it: trova i pacchetti

source: upgrade a package by replacing it with a new package. see --add for a description of the path argument
it: aggiorna un pacchetto sostituendolo con un uno nuovo. Vedi --add per avere una descrizione dell'argomento del path

source: upgrade all packages in the repo, which are available in the AUR
it: aggiorna tutti i pacchetti nel repo che sono disponibili in AUR

source: Could not reach the AUR
it: Impossibile collegarsi con AUR

source: AUR responded with error: {0}
it: AUR ha risposto con un errore: {0}

source: AUR responded with invalid data
it: AUR ha risposto con dei dati non validi

source: Execution cancelled by user
it: Esecuzione annullata dall'utente

source: Loading repo database:
it: Caricamento del database del repo:

source: This repo has no packages
it: Questo repo non contiene pacchetti

source: Package does not exist:
it: Il pacchetto non esiste:

source: Package information:
it: Informazioni del pacchetto:

source: No package found
it: Impossibile trovare il pacchetto

source: Making a new package
it: Creazione di un nuovo pacchetto

source: Upgrading package:
it: Aggiornamento del pacchetto:

source: Adding package to the repo:
it: Aggiunta del pacchetto al repo:

source: Packages do not exist:
it: I pacchetti non esistono:

source: Removing packages:
it: Rimozione dei pacchetti:

source: Retrieving package info from the AUR
it: Scaricamento delle info del pacchetto da AUR

source: Package is already in the repo:
it: Il pacchetto è già presente nel repo:

source: {0} packages found
it: {0} pacchetti trovati

source: Nothing to do
it: Nessuna operazione da eseguire

source: Checking for updates
it: Controllo degli aggiornamenti

source: All packages are up to date
it: Tutti i pacchetti sono aggiornati

source: Upgrade
it: Aggiorna

source: Bye
it: Ciao

source: Running integrity check
it: Avvio del controllo dell'integrità

source: No errors found
it: Nessun errore

source: Restoring database
it: Ripristino del database

source: Architecture
it: Architettura

source: Build Date
it: Compilato il

source: Package size
it: Dimensione del pacchetto

source: Description
it: Descrizione

source: Filename
it: Nome del file

source: Installed size
it: Spazio occupato

source: Last update
it: Ultimo aggiornamento

source: License
it: Licenza

source: Location
it: Locazione

source: Name
it: Nome

source: Packager
it: Autore

source: Packages
it: Pacchetti

source: Version
it: Versione

source: Could not download file: {0}
it: Impossibile scaricare il file: {0}

source: File is no valid tarball: {0}
it: Il file non è un tarball valido: {0}

source: Tarball contains bad member: {0}
it: Il tarball contiene membri errati: {0}

source: Tarball contains multiple root directories
it: Il tarball contiene più di una root directory

source: An error ocurred in makepkg
it: Si è verificato un errore durante l'utilizzo di makepkg

source: Could not find any package
it: Impossibile trovare i pacchetti

source: File does not exist: {0}
it: Il file non esiste: {0}

source: An error occurred in tar
it: Si è verificato un errore in tar

source: Invalid .PKGINFO
it: .PKGINFO non è valido

source: Invalid file name: {0}
it: Il nome del file non è valido: {0}

source: Destination is no directory: {0}
it: La destinazione non è una directory: {0}

source: File already exists: {0}
it: Il file già esiste: {0}

source: Package does not exist: {0}
it: Il pacchetto non esiste: {0}

source: Could not find repo database: {0}
it: Impossibile trovare il database del repo: {0}

source: File is no valid database: {0}
it: Il file non è un database valido: {0}

source: Missing database entry: {0}
it: Voce del database mancante: {0}

source: Package not found: {0}
it: Il pacchetto non è stato trovato: {0}

source: Repo package is newer: {0} > {1}
it: Il pacchetto del repo è più recente: {0} > {1}

source: Package is already in the repo: {0}
it: Il pacchetto è già presente nel repo: {0}

source: An error occurred in repo-add
it: Si è verificato un errore in repo-add

source: An error occurred in repo-remove
it: Si è verificato un errore in repo-remove

source: Package has no valid checksum: {0}
it: Il pacchetto non ha un checksum valido: {0}

source: Package is not listed in repo database: {0}
it: Il pacchetto non è elencato nel database del repo: {0}

source: Ooh no! Somebody killed the repo elephant
it: Ooh no! Qualcuno ha ucciso l'elefante del repo
